// Все, що знаходиться між відкриваючим і закриваючим тегом компонента, доступно в службовому пропсі props.children, який є у всіх компонентів.

export default function Card({ children }) {
    return <div>{children}</div>
}

// Концепція дочірніх елементів дозволяє робити композицію компонентів і використовується в більш складних завданнях. На даному етапі знайомства з компонентами важливо знати, що існує props.children і що значенням цього пропса буде те, що знаходиться між відкриваючим і закриваючим тегом компонента.